sunga2022/GP2040-WF/firmware/receiver_ch32/third_party/extralibs/fsusb.c
		USBFS->DEV_ADDR = 0;
		USBFS_InternalFinishSetup();
		USBFS->INT_FG = CRB_UIF_BUS_RST;
	}
	else if( intfgst & CRB_UIF_SUSPEND )
	{
#if ANYPRINTF
		if( usb_debug ) printf("[USB] SUSPEND\n");
#endif
		USBFS->INT_FG = USBFS_UMS_SUSPEND;
		Delay_Us(10);
		/* usb suspend interrupt processing */
		if( USBFS->MIS_ST & USBFS_UMS_SUSPEND )
		{
			ctx->USBFS_DevSleepStatus |= 0x02;
			if( ctx->USBFS_DevSleepStatus == 0x03 )
			{
				/* Handling usb sleep here */
				//TODO: MCU_Sleep_Wakeup_Operate( );
			}
		}
		else
		{
			ctx->USBFS_DevSleepStatus &= ~0x02;
		}
		
	}
	else
	{
			/* other interrupts */
			USBFS->INT_FG = intfgst & 0xff;
#if ANYPRINTF
			if( usb_debug) printf("[USB] intfgst = %04x\n",intfgst);
#endif
	}

#if FUSB_IO_PROFILE
	funDigitalWrite( DEBUG_PIN, 0 );
#endif

#if FUSB_USE_HPE
	// asm volatile( "mret" );
#endif
}

WEAK void USBFS_InternalFinishSetup()
{
	USBFS->UEP4_1_MOD = 0;
	USBFS->UEP2_3_MOD = 0;
#if defined(CH5xx) || defined(CH32X03x)
	USBFS->UEP567_MOD = 0;
#else
	USBFS->UEP5_6_MOD = 0;
	USBFS->UEP7_MOD = 0;
#endif

	for( int i = 0; i < FUSB_BUFFERS_NUMBER; i++ )
	{
		UEP_CTRL_LEN(i) = 0;
		memset(USBFSCTX.ep_buffers[i], 0, 64);
	}

int buffer_counter = 1;

	USBFSCTX.endpoints[0].mode = USBFS_EP_MODE_RX | USBFS_EP_MODE_TX;

#if FUSB_EP1_MODE
	USBFSCTX.endpoints[1].mode = FUSB_EP1_MODE;
	USBFS->UEP4_1_MOD |= FUSB_EP1_MODE << 4;
#endif

#if FUSB_EP2_MODE
	USBFSCTX.endpoints[2].mode = FUSB_EP2_MODE;
	USBFS->UEP2_3_MOD |= FUSB_EP2_MODE;
#endif

#if FUSB_EP3_MODE
	USBFSCTX.endpoints[3].mode = FUSB_EP3_MODE;
	USBFS->UEP2_3_MOD |= FUSB_EP3_MODE << 4;
#endif

#if FUSB_EP4_MODE
#if defined(CH5xx) || defined(CH32X03x)
	USBFSCTX.endpoints[4].mode = FUSB_EP4_MODE &0xc;

	USBFSCTX.endpoints[4].out = ((USBFSCTX.endpoints[4].mode & USBFS_EP_MODE_RX)?((uintptr_t)USBFSCTX.ep_buffers[buffer_counter]):0);
	USBFSCTX.endpoints[4].in = ((USBFSCTX.endpoints[4].mode & USBFS_EP_MODE_TX)?((uintptr_t)USBFSCTX.ep_buffers[buffer_counter+64]):0);
	buffer_counter += (((USBFSCTX.endpoints[4].mode & USBFS_EP_MODE_TX)?1:0) + ((USBFSCTX.endpoints[4].mode & USBFS_EP_MODE_RX)?1:0));
#else
	USBFSCTX.endpoints[4].mode = FUSB_EP4_MODE;
	USBFS->UEP4_1_MOD |= FUSB_EP4_MODE;
#endif
#endif

#if FUSB_EP5_MODE
#if defined(CH5xx) || defined(CH32X03x)
	USBFSCTX.endpoints[5].mode = FUSB_EP5_MODE & 0xc;
	USBFS->UEP567_MOD |= (FUSB_EP5_MODE & 0xc) >> 2;
#else
	USBFSCTX.endpoints[5].mode = FUSB_EP5_MODE;
	USBFS->UEP5_6_MOD |= FUSB_EP5_MODE;
#endif
#endif

#if FUSB_EP6_MODE
#if defined(CH5xx) || defined(CH32X03x)
	USBFSCTX.endpoints[6].mode = FUSB_EP6_MODE & 0xc;
	USBFS->UEP567_MOD |= FUSB_EP6_MODE & 0xc;
#else
	USBFSCTX.endpoints[6].mode = FUSB_EP6_MODE;
	USBFS->UEP5_6_MOD |= (FUSB_EP6_MODE & 0xc) << 4;
#endif
#endif

#if FUSB_EP7_MODE
#if defined(CH5xx) || defined(CH32X03x)
	USBFSCTX.endpoints[7].mode = FUSB_EP7_MODE & 0xc;
	USBFS->UEP567_MOD |= (FUSB_EP7_MODE & 0xc) << 2;
#else
	USBFSCTX.endpoints[7].mode = FUSB_EP7_MODE;
	USBFS->UEP7_MOD = FUSB_EP7_MODE;
#endif
#endif

	UEP_DMA(0) = (uintptr_t)USBFSCTX.ep_buffers[0];
	USBFSCTX.endpoints[0].in = USBFSCTX.ep_buffers[0];
	USBFSCTX.endpoints[0].out = USBFSCTX.ep_buffers[0];

	for( int i = 1; i < FUSB_MAX_EP_CNT; i++ )
	{
		#if defined(CH5xx) || defined(CH32X03x)
		if( i == 4 ) continue;
		#endif
		if( buffer_counter >= FUSB_BUFFERS_NUMBER ) break;
		if( USBFSCTX.endpoints[i].mode )
		{
			int tx_buf = ((USBFSCTX.endpoints[i].mode & USBFS_EP_MODE_TX)?1:0) + (USBFSCTX.endpoints[i].mode & 1);
			int rx_buf = ((USBFSCTX.endpoints[i].mode & USBFS_EP_MODE_RX)?1:0) + (USBFSCTX.endpoints[i].mode & 1);

			UEP_DMA(i) = (uintptr_t)USBFSCTX.ep_buffers[buffer_counter];
			if( rx_buf ) USBFSCTX.endpoints[i].out = (uint8_t *)USBFSCTX.ep_buffers[buffer_counter];
			if( tx_buf ) USBFSCTX.endpoints[i].in = (uint8_t *)USBFSCTX.ep_buffers[buffer_counter+rx_buf];

			buffer_counter += (tx_buf + rx_buf);
			// printf("EP%d mode = %d, out buffer = 0x%08x, in buffer = 0x%08x, DMA = %08x\n", i, USBFSCTX.endpoints[i].mode, USBFSCTX.endpoints[i].out, USBFSCTX.endpoints[i].in, UEP_DMA(i));
		}
	}
	
#if defined(CH5xx) || defined(CH32X03x) || defined (CH32V10x)
	UEP_CTRL_TX(0) = USBFS_UEP_T_RES_NAK | USBFS_UEP_R_RES_ACK | CHECK_USBFS_UEP_T_AUTO_TOG;
#else
	UEP_CTRL_TX(0) = USBFS_UEP_T_RES_NAK | CHECK_USBFS_UEP_T_AUTO_TOG;
	UEP_CTRL_RX(0) = USBFS_UEP_R_RES_ACK | CHECK_USBFS_UEP_R_AUTO_TOG;
#endif

	for( int i = 1; i < FUSB_MAX_EP_CNT; i++ )
	{
		if( USBFSCTX.endpoints[i].mode & USBFS_EP_MODE_TX )
		{
			UEP_CTRL_TX(i) = USBFS_UEP_T_RES_NAK;
		}

		if( USBFSCTX.endpoints[i].mode & USBFS_EP_MODE_RX )
		{
#if defined(CH5xx) || defined(CH32X03x) || defined (CH32V10x)
			UEP_CTRL_TX(i) = USBFS_UEP_R_RES_ACK;
#else
			UEP_CTRL_RX(i) = USBFS_UEP_R_RES_ACK;
#endif
		}
		USBFSCTX.endpoints[i].busy = 0;
	}
}

int USBFSSetup()
{
#if defined (CH32V10x)
#if (FUNCONF_SYSTEM_CORE_CLOCK != 72000000) && (FUNCONF_SYSTEM_CORE_CLOCK != 48000000)
#error CH32V103 needs 72MHz or 48MHz main clock for USB to work
#endif
#if FUNCONF_SYSTEM_CORE_CLOCK == 48000000
	RCC->CFGR0 |= RCC_USBPRE;  // Disable 1.5 divider for USB clock
#endif
#if defined (FUSB_VDD_5V) && FUSB_VDD_5V
	EXTEN->EXTEN_CTR |= EXTEN_USB_5V_SEL;
#endif
	EXTEN->EXTEN_CTR |= EXTEN_USBFS_IO_EN;
#endif

#if defined (CH32V20x) || defined (CH32V30x) || defined(CH32L103)
#if defined(CH32V30x_D8C)
	RCC->CFGR2 = RCC_USBHSSRC | RCC_USBHSPLL | 1<< RCC_USBHSCLK_OFFSET | RCC_USBHSPLLSRC | 1 << RCC_USBHSDIV_OFFSET;
	RCC->AHBPCENR |= RCC_USBHSEN;
#elif defined(CH32L103)
#if FUNCONF_SYSTEM_CORE_CLOCK == 96000000
	RCC->CFGR0 = (RCC->CFGR0 & ~(3<<22)) | (1<<22);
#elif FUNCONF_SYSTEM_CORE_CLOCK == 72000000
  RCC->CFGR0 = (RCC->CFGR0 & ~(3<<22)) | (2<<22);
#elif FUNCONF_SYSTEM_CORE_CLOCK == 48000000
	RCC->CFGR0 = (RCC->CFGR0 & ~(3<<22));
#else
#error CH32L103 needs 96/72/48MHz main clock for USB to work
#endif
#else
	// USBPRE[1:0] = 10: Divided by 3 (when PLLCLK=144MHz);
	// Must be done before enabling clock to USBFS tree.
#if FUNCONF_SYSTEM_CORE_CLOCK == 144000000
	RCC->CFGR0 = (RCC->CFGR0 & ~(3<<22)) | (2<<22);
#elif FUNCONF_SYSTEM_CORE_CLOCK == 96000000
	RCC->CFGR0 = (RCC->CFGR0 & ~(3<<22)) | (1<<22);
#elif FUNCONF_SYSTEM_CORE_CLOCK == 48000000
	RCC->CFGR0 = (RCC->CFGR0 & ~(3<<22));
#elif FUNCONF_SYSTEM_CORE_CLOCK == 240000000
#error CH32V20x/30x is unstable at 240MHz
#else
#error CH32V20x/30x need 144/96/48MHz main clock for USB to work
#endif
#endif
#endif

#if defined (CH32X03x)
	RCC->APB2PCENR |= RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOC;
#if FUSB_VDD_5V
	AFIO->CTLR = (AFIO->CTLR & ~(UDP_PUE_MASK | UDM_PUE_MASK | USB_PHY_V33)) | UDP_PUE_10K | USB_IOEN;
#else
	AFIO->CTLR = (AFIO->CTLR & ~(UDP_PUE_MASK | UDM_PUE_MASK )) | USB_PHY_V33 | UDP_PUE_1K5 | USB_IOEN;
#endif
	// Enable PC16/17 Alternate Function (USB)
	// According to EVT, GPIO16 = GPIO_Mode_IN_FLOATING, GPIO17 = GPIO_Mode_IPU
	GPIOC->CFGXR = 	( GPIOC->CFGXR & ~( (0xf<<(4*0)) | (0xf<<(4*1)) ) )  |
					(((GPIO_CFGLR_IN_FLOAT)<<(4*0)) | (((GPIO_CFGLR_IN_PUPD)<<(4*1)))); // MSBs are CNF, LSBs are MODE
	GPIOC->BSXR = 1<<1; // PC17 on.
#endif

#if defined (CH5xx)
#if defined (CH570_CH572)
	R16_PIN_ALTERNATE |= RB_PIN_USB_EN | RB_UDP_PU_EN;
#elif defined (CH584_CH585)
  R16_PIN_CONFIG |= RB_PIN_USB_EN | RB_UDP_PU_EN;
#else
	R16_PIN_ANALOG_IE |= RB_PIN_USB_IE | RB_PIN_USB_DP_PU;
#endif

#else

#if defined (CH32V10x) || defined (CH32V30x) || defined(CH32L103)
	RCC->APB2PCENR |= RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOA;
#endif

#if defined (CH32V20x)
	RCC->APB2PCENR |= RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOB;
#endif

	RCC->AHBPCENR |= RCC_USBFS | RCC_AHBPeriph_DMA1;
	
#endif

